# ContinuousRailSupportPlacementFailure Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..StairRampFailures..::..ContinuousRailSupportPlacementFailure Property
BuiltInFailures..::..StairRampFailures Class See Also
---
Cannot place the supports along the rail path.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId ContinuousRailSupportPlacementFailure { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ContinuousRailSupportPlacementFailure As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ ContinuousRailSupportPlacementFailure {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..StairRampFailures Class
Autodesk.Revit.DB Namespace